test-scripts/testcases/3nodes-2clients/set1-3nodes-2client-10mil-50k-1k/TestCase-10mil-50k-1k-p2-2020-09-10-00:45:52/perf-test.txt
53371 records sent, 10674.2 records/sec (10.42 MB/sec), 1314.3 ms avg latency, 1790.0 ms max latency.
154470 records sent, 30894.0 records/sec (30.17 MB/sec), 963.1 ms avg latency, 1698.0 ms max latency.
151624 records sent, 30324.8 records/sec (29.61 MB/sec), 967.0 ms avg latency, 2302.0 ms max latency.
165521 records sent, 33104.2 records/sec (32.33 MB/sec), 932.4 ms avg latency, 2487.0 ms max latency.
200151 records sent, 40030.2 records/sec (39.09 MB/sec), 801.2 ms avg latency, 2399.0 ms max latency.
332085 records sent, 66417.0 records/sec (64.86 MB/sec), 480.6 ms avg latency, 1788.0 ms max latency.
304452 records sent, 60732.5 records/sec (59.31 MB/sec), 517.8 ms avg latency, 1373.0 ms max latency.
322457 records sent, 64491.4 records/sec (62.98 MB/sec), 478.1 ms avg latency, 1070.0 ms max latency.
345471 records sent, 69094.2 records/sec (67.47 MB/sec), 436.5 ms avg latency, 1194.0 ms max latency.
352188 records sent, 70437.6 records/sec (68.79 MB/sec), 444.3 ms avg latency, 1185.0 ms max latency.
338117 records sent, 67623.4 records/sec (66.04 MB/sec), 454.5 ms avg latency, 1064.0 ms max latency.
280785 records sent, 56157.0 records/sec (54.84 MB/sec), 185.7 ms avg latency, 792.0 ms max latency.
248550 records sent, 49710.0 records/sec (48.54 MB/sec), 15.5 ms avg latency, 163.0 ms max latency.
251190 records sent, 50238.0 records/sec (49.06 MB/sec), 19.1 ms avg latency, 157.0 ms max latency.
250320 records sent, 50064.0 records/sec (48.89 MB/sec), 11.1 ms avg latency, 112.0 ms max latency.
250050 records sent, 50010.0 records/sec (48.84 MB/sec), 5.4 ms avg latency, 76.0 ms max latency.
250015 records sent, 50003.0 records/sec (48.83 MB/sec), 6.0 ms avg latency, 81.0 ms max latency.
250025 records sent, 50005.0 records/sec (48.83 MB/sec), 6.2 ms avg latency, 165.0 ms max latency.
249960 records sent, 49992.0 records/sec (48.82 MB/sec), 3.6 ms avg latency, 49.0 ms max latency.
250050 records sent, 50010.0 records/sec (48.84 MB/sec), 4.3 ms avg latency, 65.0 ms max latency.
250030 records sent, 50006.0 records/sec (48.83 MB/sec), 4.3 ms avg latency, 57.0 ms max latency.
250020 records sent, 50004.0 records/sec (48.83 MB/sec), 7.5 ms avg latency, 92.0 ms max latency.
249510 records sent, 49902.0 records/sec (48.73 MB/sec), 5.7 ms avg latency, 72.0 ms max latency.
250492 records sent, 50098.4 records/sec (48.92 MB/sec), 11.3 ms avg latency, 119.0 ms max latency.
249993 records sent, 49998.6 records/sec (48.83 MB/sec), 4.8 ms avg latency, 58.0 ms max latency.
250012 records sent, 50002.4 records/sec (48.83 MB/sec), 9.4 ms avg latency, 169.0 ms max latency.
249993 records sent, 49998.6 records/sec (48.83 MB/sec), 4.7 ms avg latency, 75.0 ms max latency.
250004 records sent, 50000.8 records/sec (48.83 MB/sec), 4.1 ms avg latency, 107.0 ms max latency.
250046 records sent, 50009.2 records/sec (48.84 MB/sec), 4.1 ms avg latency, 60.0 ms max latency.
250000 records sent, 50000.0 records/sec (48.83 MB/sec), 7.3 ms avg latency, 115.0 ms max latency.
250000 records sent, 50000.0 records/sec (48.83 MB/sec), 3.5 ms avg latency, 56.0 ms max latency.
249340 records sent, 49868.0 records/sec (48.70 MB/sec), 8.8 ms avg latency, 142.0 ms max latency.
249751 records sent, 49950.2 records/sec (48.78 MB/sec), 9.9 ms avg latency, 116.0 ms max latency.
250462 records sent, 50092.4 records/sec (48.92 MB/sec), 5.7 ms avg latency, 116.0 ms max latency.
250497 records sent, 50099.4 records/sec (48.93 MB/sec), 6.6 ms avg latency, 115.0 ms max latency.
249780 records sent, 49956.0 records/sec (48.79 MB/sec), 4.5 ms avg latency, 65.0 ms max latency.
249665 records sent, 49933.0 records/sec (48.76 MB/sec), 8.5 ms avg latency, 80.0 ms max latency.
250505 records sent, 50101.0 records/sec (48.93 MB/sec), 3.5 ms avg latency, 83.0 ms max latency.
250035 records sent, 50007.0 records/sec (48.83 MB/sec), 1.7 ms avg latency, 50.0 ms max latency.
10000000 records sent, 49999.750001 records/sec (48.83 MB/sec), 171.21 ms avg latency, 2487.00 ms max latency, 1 ms 50th, 1095 ms 95th, 2193 ms 99th, 2402 ms 99.9th.

Metric Name                                                                         Value
app-info:commit-id:{client-id=producer-1}                                         : f960e3745ec74111
app-info:start-time-ms:{client-id=producer-1}                                     : 1599669973270
app-info:version:{client-id=producer-1}                                           : 2.5.0.redhat-00003
kafka-metrics-count:count:{client-id=producer-1}                                  : 126.000
producer-metrics:batch-size-avg:{client-id=producer-1}                            : 14303.799
producer-metrics:batch-size-max:{client-id=producer-1}                            : 15556.000
producer-metrics:batch-split-rate:{client-id=producer-1}                          : 0.000
producer-metrics:batch-split-total:{client-id=producer-1}                         : 0.000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                    : 33554432.000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                     : 0.000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                    : 0.000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                        : 33554432.000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                     : 0.000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                : 45459348992.000
producer-metrics:compression-rate-avg:{client-id=producer-1}                      : 1.000
producer-metrics:connection-close-rate:{client-id=producer-1}                     : 0.000
producer-metrics:connection-close-total:{client-id=producer-1}                    : 0.000
producer-metrics:connection-count:{client-id=producer-1}                          : 4.000
producer-metrics:connection-creation-rate:{client-id=producer-1}                  : 0.000
producer-metrics:connection-creation-total:{client-id=producer-1}                 : 4.000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                : 0.000
producer-metrics:failed-authentication-total:{client-id=producer-1}               : 0.000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}              : 0.000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}             : 0.000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                        : 231131.984
producer-metrics:incoming-byte-total:{client-id=producer-1}                       : 45443837.000
producer-metrics:io-ratio:{client-id=producer-1}                                  : 0.101
producer-metrics:io-time-ns-avg:{client-id=producer-1}                            : 17249.651
producer-metrics:io-wait-ratio:{client-id=producer-1}                             : 0.786
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                       : 134551.361
producer-metrics:io-waittime-total:{client-id=producer-1}                         : 138753761491.000
producer-metrics:iotime-total:{client-id=producer-1}                              : 25336813486.000
producer-metrics:metadata-age:{client-id=producer-1}                              : 199.188
producer-metrics:network-io-rate:{client-id=producer-1}                           : 7222.683
producer-metrics:network-io-total:{client-id=producer-1}                          : 1420074.000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                        : 51858174.420
producer-metrics:outgoing-byte-total:{client-id=producer-1}                       : 10413077280.000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                 : 0.000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                 : 0.000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}              : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}              : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                         : 0.000
producer-metrics:record-error-total:{client-id=producer-1}                        : 0.000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                     : 3.831
producer-metrics:record-queue-time-max:{client-id=producer-1}                     : 135.000
producer-metrics:record-retry-rate:{client-id=producer-1}                         : 0.000
producer-metrics:record-retry-total:{client-id=producer-1}                        : 0.000
producer-metrics:record-send-rate:{client-id=producer-1}                          : 49789.362
producer-metrics:record-send-total:{client-id=producer-1}                         : 10000000.000
producer-metrics:record-size-avg:{client-id=producer-1}                           : 1110.000
producer-metrics:record-size-max:{client-id=producer-1}                           : 1110.000
producer-metrics:records-per-request-avg:{client-id=producer-1}                   : 13.788
producer-metrics:request-latency-avg:{client-id=producer-1}                       : 1.460
producer-metrics:request-latency-max:{client-id=producer-1}                       : 80.000
producer-metrics:request-rate:{client-id=producer-1}                              : 3611.389
producer-metrics:request-size-avg:{client-id=producer-1}                          : 14359.330
producer-metrics:request-size-max:{client-id=producer-1}                          : 15612.000
producer-metrics:request-total:{client-id=producer-1}                             : 710037.000
producer-metrics:requests-in-flight:{client-id=producer-1}                        : 0.000
producer-metrics:response-rate:{client-id=producer-1}                             : 3611.364
producer-metrics:response-total:{client-id=producer-1}                            : 710037.000
producer-metrics:select-rate:{client-id=producer-1}                               : 5839.633
producer-metrics:select-total:{client-id=producer-1}                              : 1087226.000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1} : 0.000
producer-metrics:successful-authentication-rate:{client-id=producer-1}            : 0.000
producer-metrics:successful-authentication-total:{client-id=producer-1}           : 0.000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}          : 0.000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}         : 0.000
producer-metrics:waiting-threads:{client-id=producer-1}                           : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--1}  : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-0}   : 76782.724
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}   : 76953.144
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-2}   : 77377.511
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--1} : 733.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-0}  : 15123872.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}  : 15146592.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-2}  : 15172640.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--1}  : 0.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-0}   : 16981799.583
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}   : 17742369.665
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-2}   : 17131167.597
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--1} : 101.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-0}  : 3387035215.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}  : 3530171757.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-2}  : 3495870207.000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--1} : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-0}  : 0.611
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}  : 1.816
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-2}  : 1.947
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--1} : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-0}  : 80.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}  : 76.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-2}  : 73.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--1}        : 0.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-0}         : 1199.742
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}         : 1202.405
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-2}         : 1208.985
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--1}    : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-0}     : 14154.539
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}     : 14755.436
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-2}     : 14169.874
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--1}    : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-0}     : 15612.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}     : 15612.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-2}     : 15612.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--1}       : 2.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-0}        : 236306.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}        : 236661.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-2}        : 237068.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--1}       : 0.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-0}        : 1199.730
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}        : 1202.417
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-2}        : 1209.024
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--1}      : 2.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-0}       : 236306.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}       : 236661.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-2}       : 237068.000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=topic1}             : 51651602.724
producer-topic-metrics:byte-total:{client-id=producer-1, topic=topic1}            : 10373315198.000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=topic1}      : 1.000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=topic1}     : 0.000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=topic1}    : 0.000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=topic1}     : 0.000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=topic1}    : 0.000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=topic1}      : 49788.314
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=topic1}     : 10000000.000
pod "kafka-producer-perf" deleted